000100* a comment
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. main.

000400 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER. GNU Linux.
           OBJECT-COMPUTER. GNU Linux.
       INPUT-OUTPUT SECTION.

000500 DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 WS-VAR PIC 9(4) VALUE 0.
       01 WS-INPUT PIC 9(4) VALUE 0.
       01 WS-INIT PIC 9(4) VALUE 0.

       LOCAL-STORAGE SECTION.

       LINKAGE SECTION.

000600 PROCEDURE DIVISION.
           DISPLAY 'my program'. 
           INITIALIZE WS-INIT REPLACING NUMERIC DATA BY 12345
           DISPLAY "WS-INIT : "WS-INIT.
           DISPLAY "WS-VAR : "WS-VAR.
           ACCEPT WS-INPUT.
           MOVE WS-INPUT TO WS-VAR.
           DISPLAY "WS-VAR : "WS-VAR.
           ADD WS-VAR TO WS-INIT.
           DISPLAY "WS-INIT : "WS-INIT.
           STOP RUN.
